<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"c2dc633547bb2e833feb68670f09e3bf17705210db4f5ae991ddf9202f655898","plan_job_ref":"Job Pull Request Checks #4474 at https://github.com/GSA-TTS/FAC/actions/runs/13861353224","plan_out_hash":"77d2e93dce32858b57ed55436823dd2866c18cb440a1e6a0cb37d434d5176576","plan_hash":"cb6053ebc289c1ed8f27a3e09ca9c5b40a2b6ec66a0fdced5cd73e7caa0ef90f","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.domain.cloudfoundry_route.origin_route_connected[0] will be created
+   resource "cloudfoundry_route" "origin_route_connected" {
+       created_at   = (known after apply)
+       destinations = [
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
+       domain       = "559e0623-9057-45ef-a9ca-e183df56b4e3"
+       host         = "app"
+       id           = (known after apply)
+       protocol     = (known after apply)
+       space        = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       updated_at   = (known after apply)
+       url          = (known after apply)
    }

  # module.domain.cloudfoundry_service_instance.external_domain_instance will be updated in-place
!~  resource "cloudfoundry_service_instance" "external_domain_instance" {
+       dashboard_url     = (known after apply)
        id                = "c36480a2-ec78-4e75-b175-d6b53abf2400"
!~      last_operation    = {
!~          created_at  = "2025-03-14T15:51:27Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T15:51:27Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "gsa-fac-fac.gov"
!~      parameters        = (sensitive value)
        tags              = [
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T15:51:27Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (4 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-03-14T17:53:21Z" -> (known after apply)
        }
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
        id                              = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
        name                            = "https-proxy"
!~      source_code_hash                = "5a8b0befc063a4694d176a8e843be43565ed3f15d6d4fe2c19693d6d10568c25" -> "48b2f5eba8d1f35c0fbc2f90c2ec87cab180f5f19e7e34b16b9190fe5c5ca09a"
#        (21 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4474](https://github.com/GSA-TTS/FAC/actions/runs/13861353224)